/******************************************************************************
 *                      rhc_media - Mario no Gourmetrace                      *
 *                       Copyright (C) 2020  devwizard                        *
 *        This project is licensed under the terms of the GNU General         *
 *        Public License version 2.  See LICENSE for more information.        *
 ******************************************************************************/

#ifndef _SM64_H_
#define _SM64_H_

#include <ultra64.h>

#define G_R_BACKGROUND          0x00
#define G_R_OPA_SURF            0x01
#define G_R_OPA_DECAL           0x02
#define G_R_OPA_INTER           0x03
#define G_R_SPRITE              0x04
#define G_R_XLU_SURF            0x05
#define G_R_XLU_DECAL           0x06
#define G_R_XLU_INTER           0x07

#define G_O_KOOPA               0x68

#ifndef __ASSEMBLER__

#define PLAYER_STATE_NULL       0x00000000
#define PLAYER_STATE_IDLE       0x0C400201
#define PLAYER_STATE_WAITMSG    0x0000130A
#define PLAYER_STATE_SPAWNAIR   0x00001932

#define PLAYER_MOTION_MESSAGE   0xC2
#define PLAYER_MOTION_WINDEMO   0xCD

#define HUD_LIFE                0x0001
#define HUD_COIN                0x0002
#define HUD_STAR                0x0004
#define HUD_POWER               0x0008
#define HUD_KEY                 0x0010
#define HUD_0020                0x0020
#define HUD_TIME                0x0040

#define SFX_GS1_GUNSHOT         0x314D4081
#define SFX_GS1_CORRECT         0x306A8081
#define SFX_SYS_CAMMOVE         0x700F0081
#define SFX_SYS_START           0x701EFF81

#define game_timer_show()       game_timer_main(0)
#define game_timer_start()      game_timer_main(1)
#define game_timer_stop()       game_timer_main(2)
#define game_timer_hide()       game_timer_main(3)
#define game_timer_value()      game_timer_main(4)

#define mem_alloc_l(size)       mem_alloc(size, 0)
#define mem_alloc_r(size)       mem_alloc(size, 1)

#define menu_scroll_v(index, min, max)  menu_scroll(1, index, min, max)
#define menu_scroll_h(index, min, max)  menu_scroll(2, index, min, max)

#define sin(x)  math_sin[(u16)(x) >> 4]
#define cos(x)  math_cos[(u16)(x) >> 4]

#define o_pos_x                 mem[0x06].f32
#define o_pos_y                 mem[0x07].f32
#define o_pos_z                 mem[0x08].f32
#define o_vel_x                 mem[0x09].f32
#define o_vel_y                 mem[0x0A].f32
#define o_vel_z                 mem[0x0B].f32
#define o_vel_f                 mem[0x0C].f32
#define o_vel_l                 mem[0x0D].f32
#define o_vel_u                 mem[0x0E].f32
#define o_rot_x                 mem[0x0F].s32
#define o_rot_y                 mem[0x10].s32
#define o_rot_z                 mem[0x11].s32
#define o_rot_gfx_x             mem[0x12].s32
#define o_rot_gfx_y             mem[0x13].s32
#define o_rot_gfx_z             mem[0x14].s32
#define o_move_flag             mem[0x19].u32
#define o_path_rx               mem[0x20].s32
#define o_path_ry               mem[0x21].s32
#define o_motion_table          mem[0x26].ptr
#define o_state                 mem[0x31].s32
#define o_mode                  mem[0x32].s32

struct pad_t
{
    /* 0x00 */  s16     stick_x;
    /* 0x02 */  s16     stick_y;
    /* 0x04 */  f32     stick[2];
    /* 0x0C */  f32     stick_mag;
    /* 0x10 */  u16     held;
    /* 0x12 */  u16     down;
    /* 0x14 */  void   *pad;
    /* 0x18 */  void   *status;
};  /* 0x1C */

struct g_t
{
    /* 0x00 */  u16 type;
    /* 0x02 */  u16 flags;
    /* 0x04 */  struct g_t *prev;
    /* 0x08 */  struct g_t *next;
    /* 0x0C */  struct g_t *parent;
    /* 0x10 */  struct g_t *child;
};  /* 0x14 */

struct gc_t
{
    /* 0x00 */  struct g_t g;
    /* 0x14 */  Gfx *(*callback)(int, struct gc_t *, void *);
    /* 0x18 */  s32 arg;
};  /* 0x1C */

struct g_motion_t
{
    /* 0x00 0x38 */ s16     index;
    /* 0x02 0x3A */ s16     height;
    /* 0x04 0x3C */ struct motion_t *motion;
    /* 0x08 0x40 */ s16     frame;
    /* 0x0A 0x42 */ u16     timer;
    /* 0x0C 0x44 */ s32     frame_amt;
    /* 0x10 0x48 */ s32     frame_vel;
};  /* 0x14 0x4C */

struct g_object_t
{
    /* 0x00 */  struct g_t g;
    /* 0x14 */  struct g_t *list;
    /* 0x18 */  s8      world_index;
    /* 0x19 */  s8      gfx_index;
    /* 0x1A */  s16     rot[3];
    /* 0x20 */  f32     pos[3];
    /* 0x2C */  f32     scale[3];
    /* 0x38 */  struct g_motion_t motion;
    /* 0x4C */  void   *_4C;
    /* 0x50 */  f32   (*mtxf)[4][4];
    /* 0x54 */  f32     pos_sfx[3];
};  /* 0x60 */

struct gc_camera_t
{
    /* 0x00 */  struct gc_t gc;
    /* 0x1C */  f32     pos[3];
    /* 0x28 */  f32     obj[3];
    /* 0x34 */  f32   (*mtxf)[4][4];
    /* 0x38 */  s16     rot_z_m;
    /* 0x3A */  s16     rot_z_p;
};  /* 0x3C */

struct camera_t
{
    /* 0x00 */  u8      mode;
    /* 0x01 */  u8      mode_prev;
    /* 0x02 */  s16     yaw;
    /* 0x04 */  f32     obj[3];
    /* 0x10 */  f32     pos[3];
    /* 0x1C */  s16     rot[3];
    /* 0x22 */  s16     _22[3];
    /* 0x28 */  f32     _28;
    /* 0x2C */  f32     _2C;
    /* 0x30 */  u8      mode_demo;
    /* 0x34 */  f32     _34;
    /* 0x38 */  s8      _38;
    /* 0x3A */  s16     _3A;
    /* 0x3C */  s16     _3C;
    /* 0x3E */
};

struct object_t
{
    /* 0x0000 */    struct g_object_t go;
    /* 0x0060 */    struct object_t *next;
    /* 0x0064 */    struct object_t *prev;
    /* 0x0068 */    struct object_t *parent;
    /* 0x006C */    struct object_t *child;
    /* 0x0070 */    u32     touch;
    /* 0x0074 */    s16     flag;
    /* 0x0076 */    s16     object_touch_len;
    /* 0x0078 */    struct object_t *object_touch[4];
    /* 0x0088 */    union
                    {
                        s8      s8[4];
                        u8      u8[4];
                        s16     s16[2];
                        u16     u16[2];
                        s32     s32;
                        u32     u32;
                        f32     f32;
                        void   *ptr;
                    }
                    mem[80];
    /* 0x01C8 */    void   *_1C8;
    /* 0x01CC */    uintptr_t *pc;
    /* 0x01D0 */    uintptr_t stack_index;
    /* 0x01D4 */    uintptr_t stack[8];
    /* 0x01F4 */    s16     _1F4;
    /* 0x01F6 */    s16     _1F6;
    /* 0x01F8 */    f32     _1F8;
    /* 0x01FC */    f32     _1FC;
    /* 0x0200 */    f32     _200;
    /* 0x0204 */    f32     _204;
    /* 0x0208 */    f32     _208;
    /* 0x020C */    uintptr_t *script;
    /* 0x0210 */    struct object_t *_210;
    /* 0x0214 */    struct object_t *_214;
    /* 0x0218 */    s16    *_218;
    /* 0x021C */    f32     mtxf[4][4];
    /* 0x025C */    void   *_25C;
};  /* 0x0260 */

struct player_gfx_t
{
    /* 0x00 */  u32     state;
    /* 0x04 */  s8      head;
    /* 0x05 */  s8      eyes;
    /* 0x06 */  s8      gloves;
    /* 0x07 */  s8      wings;
    /* 0x08 */  s16     cap;
    /* 0x0A */  s8      hold;
    /* 0x0B */  u8      punch;
    /* 0x0C */  s16     rot_torso[3];
    /* 0x12 */  s16     rot_head[3];
    /* 0x18 */  f32     pos_glove[3];
    /* 0x24 */  struct object_t *object;
};  /* 0x28 */

struct player_t
{
    /* 0x00 */  u16     index;
    /* 0x02 */  u16     event;
    /* 0x04 */  u32     flag;
    /* 0x08 */  u32     particle;
    /* 0x0C */  u32     state;
    /* 0x10 */  u32     state_prev;
    /* 0x14 */  u32     ground_sfx;
    /* 0x18 */  s16     state_mode;
    /* 0x1A */  u16     state_timer;
    /* 0x1C */  u32     state_arg;
    /* 0x20 */  f32     stick_mag;
    /* 0x24 */  s16     stick_rot;
    /* 0x26 */  s16     timer_invincible;
    /* 0x28 */  u8      timer_a_down;
    /* 0x29 */  u8      timer_b_down;
    /* 0x2A */  u8      timer_col_wall;
    /* 0x2B */  u8      timer_col_floor;
    /* 0x2C */  s16     rot[3];
    /* 0x32 */  s16     rot_vel[3];
    /* 0x38 */  s16     rot_slide;
    /* 0x3A */  s16     rot_twirl;
    /* 0x3C */  f32     pos[3];
    /* 0x48 */  f32     vel[3];
    /* 0x54 */  f32     vel_f;
    /* 0x58 */  f32     vel_h[2];
    /* 0x60 */  void   *wall;
    /* 0x64 */  void   *roof;
    /* 0x68 */  void   *ground;
    /* 0x6C */  f32     height_roof;
    /* 0x70 */  f32     height_ground;
    /* 0x74 */  s16     rot_ground;
    /* 0x76 */  s16     height_water;
    /* 0x78 */  struct object_t *object_touch;
    /* 0x7C */  struct object_t *object_hold;
    /* 0x80 */  struct object_t *object_use;
    /* 0x84 */  struct object_t *object_ride;
    /* 0x88 */  struct object_t *object;
    /* 0x8C */  void   *_8C;
    /* 0x90 */  void   *world;
    /* 0x94 */  void   *camera;
    /* 0x98 */  struct player_gfx_t *gfx;
    /* 0x9C */  struct pad_t *pad;
    /* 0xA0 */  struct motion_t *motion;
    /* 0xA4 */  u32     touch;
    /* 0xA8 */  s16     coin;
    /* 0xAA */  s16     star;
    /* 0xAC */  s8      key;
    /* 0xAD */  s8      life;
    /* 0xAE */  s16     health;
    /* 0xB0 */  s16     motion_height;
    /* 0xB2 */  u8      timer_power_dec;
    /* 0xB3 */  u8      timer_power_inc;
    /* 0xB4 */  u8      timer_squish;
    /* 0xB5 */  u8      timer_dither;
    /* 0xB6 */  u16     timer_cap;
    /* 0xB8 */  s16     star_prev;
    /* 0xBC */  f32     height_peak;
    /* 0xC0 */  f32     height_sink;
    /* 0xC4 */  f32     gravity;
};  /* 0xC8 */

struct hud_t
{
    /* 0x00 */  s16     lives;
    /* 0x02 */  s16     coins;
    /* 0x04 */  s16     stars;
    /* 0x06 */  s16     power;
    /* 0x08 */  s16     keys;
    /* 0x0A */  s16     flag;
    /* 0x0C */  u16     timer;
};  /* 0x0E */

/* 0x802473C8 */ extern void  app_gfx_start_cimg(void);
/* 0x80247D14 */ extern void  app_gfx_end(void);
/* 0x802495E0 */ extern u16   game_timer_main(int mode);
/* 0x80249764 */ extern void  game_state_set(s16 state);
/* 0x8024978C */ extern void  game_state_end(int arg);
/* 0x802497B8 */ extern void  game_state_end_wipe(int arg, uint shade);
/* 0x8024A700 */ extern void  game_link(
    s16 stage, s16 world, s16 link, uint arg
);
/* 0x8024BCD8 */ extern s32   game_main(s16 arg, s32 state);
/* 0x802509B8 */ extern s32   player_motion_set(
    struct player_t *player, s32 motion
);
/* 0x80252CF4 */ extern u32   player_state_set(
    struct player_t *player, u32 state, u32 arg
);
/* 0x80277F50 */ extern void *mem_segment(const void *);
/* 0x80278120 */ extern void *mem_alloc(size_t size, uint side);
/* 0x80278120 */ extern void  mem_free(void *ptr);
/* 0x80278504 */ extern void  mem_dma_read(
